In [ ]:
import sqlite3

In [ ]:
#01) Write a sql query to get books that has rate >=3 and has 'Mr' in its name.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT * FROM books WHERE rating >= 3 and name LIKE '%Mr%'"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#02) Write a sql query to get books that has rate >=3 or price > 20.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT * FROM Books WHERE rating >= 3 and price > 20"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#04) Write a sql query to get books that has price between 10 and 40 and has rate 3 or 4 or 1.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT * FROM books WHERE not rating = 3"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#05) Write a sql query to get the top 5 most expensive books (order books desc with price column and then limit the result to the first 5).
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT * FROM Books ORDER BY price desc limit 5"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#06) Write a sql query to get the 3rd 10 books in the books table order first by rate desc and then by price asc.

connection = sqlite3.connect('BooksDB.db')

sql = "SELECT * FROM Books ORDER BY rating desc limit 20"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#07) Write a sql query to add a new category in categories table and add 5 books to this category in books table with title, rate and price.
connection = sqlite3.connect('BooksDB.db')

sql = "INSERT INTO categories(id,category) VALUES (49, 'Action');"
data = connection.execute(sql).fetchall()
sql = "INSERT INTO books VALUES ('Book1', 'Action','20.0','3');"
data = connection.execute(sql).fetchall()
sql = "INSERT INTO books VALUES ('Book2', 'Action','20.0','3');"
data = connection.execute(sql).fetchall()
sql = "INSERT INTO books VALUES ('Book3', 'Action','20.0','3');"
data = connection.execute(sql).fetchall()
sql = "INSERT INTO books VALUES ('Book4', 'Action','20.0','3');"
data = connection.execute(sql).fetchall()
sql = "INSERT INTO books VALUES ('Book5', 'Action','20.0','3');"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#08) Write a sql query to update book's rate to 3 that thier price < 20£.
connection = sqlite3.connect('BooksDB.db')

sql = "UPDATE books SET rating = 3 WHERE price < 20"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#09) Write a sql query to delete all books that have price > 50£ and has rate <= 2.
connection = sqlite3.connect('BooksDB.db')

sql = "DELETE FROM books WHERE price > 50 AND rating <=2;"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#10) Write a sql query to count the number of books that have 'Secret' in thier names and price between 10£ and 25£.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT count(price) FROM books WHERE name LIKE '%Secret%' AND price BETWEEN 10 AND 25"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#11) Write a sql query to get the minimum & maximum price for all the books that have rate 5.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT MIN(price),Max(price) FROM books WHERE rating = 5"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#12) Write a sql query to calculate the avg price for all the books that have rate 5.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT AVG(price) FROM books  WHERE rating = 5"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#13) Write a sql query to sum all book's price that have rate 2 and price between 10 and 40
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT sum(price) FROM books WHERE rating = 2 AND price BETWEEN 10 AND 40"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#14) Write a sql query to join both books & categories table into one new table containing book_name & category_name & book_rate and book_price.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT b.name,c.category,b.rating,b.price FROM books b JOIN categories c ON c.category = b.category"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#15) Write a sql query to calculate how many books each rate has and have price between 20£ and 30£.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT rating,count(rating),price FROM books GROUP BY rating HAVING price BETWEEN 20 AND 30"
data = connection.execute(sql).fetchall()

connection.close()

In [ ]:
#16) Write a sql query to calculate how many books each category has having count > 10.
connection = sqlite3.connect('BooksDB.db')

sql = "SELECT category,count(category) as num_of_books FROM books GROUP BY category HAVING num_of_books > 10"
data = connection.execute(sql).fetchall()

connection.close()